[
    {
        "ratings": {
            "2 star": "5%",
            "1 star": "25%",
            "4 star": "20%",
            "5 star": "35%",
            "3 star": "15%"
        },
        "name": "PcProfessional Screen Protector (Set of 2) for Dell Inspiron 15 7559 7568 15.6\" Touch Screen Laptop High Clarity Anti Scratch filter radiation",
        "reviews": [
            {
                "review_rating": "3.0 ",
                "review_comment_count": "",
                "review_header": "IMPOSSIBLE to Apply Perfectly... Unless You Have Machine-Like Precision. There Will Be Bubbles!",
                "review_text": "3 Stars. I'm really not a huge fan of these screen protectors to begin with since they're so hard to apply correctly. This comes as a set of two so basically you get two tries to put this thing on. I completely whiffed the first time and the second time I'd consider a foul ball. Let me tell you, I'm horrible at applying these protectors even cell phones but on a screen this big I don't care who you are, it's almost impossible. Currently, there are numerous visible dust particles caught in between the screen and the protector; they drive me crazy for sure, but the only reason I keep it on there is I don't want to scratch the screen. For the price I can't recommend this product. If it were $5 cheaper or if there were more units included then I'd consider it. Just be forewarned, you're not going to get it on the first attempt and you might have to do some trimming.",
                "review_posted_date": "31 Jan 2017",
                "review_author": " DH"
            },
            {
                "review_rating": "1.0 ",
                "review_comment_count": "",
                "review_header": "False advertising",
                "review_text": "Bought this for my Dell Inspiron i7559-2512BLK 15.6 Inch FHD Laptop And it's too big Covers more than the screen, Idk why, some trimming is absolutely nessacery, False advertising for the screen Very disappointed",
                "review_posted_date": "29 Jul 2016",
                "review_author": " ReyesScar"
            },
            {
                "review_rating": "4.0 ",
                "review_comment_count": "1",
                "review_header": "Too large but otherwise excellent.",
                "review_text": "Includes two screen protectors, plastic squeegee, and microfiber cleaning cloth. Supposedly sized for a 15.6 inch Dell 15559 series laptop screen. Actually sized to cover both the screen and the bezel. The bezel is raised and not smooth so the protectors were actually too large for the screen itself. Minor inconvenience to cut them down to size. After that a perfect, bubble-free installation proceeding according to the package directions. Used a vac with a duster attachment after cleaning the screen to insure no dust. Absolutely transparent with no graphics distortion. Same gloss as the original screen. Touch screen functions work normally. Surface was just a little grabbier than the original screen; a very light coating of silicone made it virtually frictionless. And I have a left over spare to replace the first if it gets too boogered up. Except for the need to cut it down, pretty near perfect.",
                "review_posted_date": "06 Jul 2016",
                "review_author": " read"
            },
            {
                "review_rating": "1.0 ",
                "review_comment_count": "",
                "review_header": "Not for Dell Inspirion i7559",
                "review_text": "Unfortunately this screen protector covers the microphones on either side of the webcam on my Dell Inspirion 7559, which results in a loud static noise and muffled voice when making Skype calls. Thus I cannot recommend this screen protector for the Dell i7559.",
                "review_posted_date": "28 Aug 2016",
                "review_author": " Stephan"
            },
            {
                "review_rating": "4.0 ",
                "review_comment_count": "",
                "review_header": "It does the job but given the large screen size ...",
                "review_text": "It does the job but given the large screen size, it is nearly impossible to put on without something getting behind it. You will need the set of 2 just to get one to work right. First one would not adhere to the corners of the screen. I assume it was something I did when I tried to peel off the corner.",
                "review_posted_date": "19 Jan 2017",
                "review_author": " Rick Kell"
            },
            {
                "review_rating": "5.0 ",
                "review_comment_count": "",
                "review_header": "It does what a screen protector should.",
                "review_text": "I recently purchased a Dell Inspiron 15.6 inch laptop from Best Buy, and this screen protector fit perfectly. There were some bubbles from incorrect application and a little peeling, but those issues aren't anything new with screen protectors. The plastic doesn't add any glare or create any issues with seeing the screen. I've been using the first screen protector from the pack for about 6 months now with no issues so far. Overall, this is a great screen protector for the price and I will buy the pack of two again after I've used my second protector.",
                "review_posted_date": "13 Jan 2017",
                "review_author": " Royce Salvador"
            },
            {
                "review_rating": "3.0 ",
                "review_comment_count": "",
                "review_header": "Good screen protector BUT!!!",
                "review_text": "I buy this protector for the touch model, this don't work for the non touch model, the screen is very clean with this protector but something that I don't like is that the protector cover the microphone, and this disappointed use this protector, I keep using for a few month and later I leave the screen without this screen protector, I clean the screen every day. You have to put this carefully because you can damage the protector or the screen can keep some air bubbles in the protector, the first protector I damage that putting on the computer I leave the second and later I decide to quit because the microphone don't hear so Good. But is clean and protect the screen",
                "review_posted_date": "27 Oct 2016",
                "review_author": " Carlos Almanzar"
            },
            {
                "review_rating": "4.0 ",
                "review_comment_count": "",
                "review_header": "works for DELL Inspiron 15 7000 series 2-in-1 laptop",
                "review_text": "It's great and necessary to have two of them, cause you have two shots better than just one. When I got the package, it was bent. I received a replacement after contact the seller. So do need to worry about it. It does need some skills to put the protector on your screen. You really need to CLEAN the screen before apply the protector. The first time I did, several air bubbles were stuck there and won't go away. But I can live with that and save the second one for next time.",
                "review_posted_date": "18 Jun 2016",
                "review_author": " Amazon Customer"
            }
        ],
        "price": "$14.99",
        "url": "http://www.amazon.com/dp/B018TM8MPA"
    }
]